VDowbensky/LoRa-platform/FW/usb_sigle_virtual_com_slave_v0.2/example/EWARM/hc32l176.svd
                <register>
                    <name>PERI_CLKEN1</name>
                    <description>desc PERI_CLKEN1</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>USB</name>
                            <description>desc USB</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN</name>
                            <description>desc CAN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTS</name>
                            <description>desc CTS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAC</name>
                            <description>desc DAC</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPTIM1</name>
                            <description>desc LPTIM1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2S0</name>
                            <description>desc I2S0</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2S1</name>
                            <description>desc I2S1</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART2</name>
                            <description>desc UART2</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART3</name>
                            <description>desc UART3</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL_CR</name>
                    <description>desc PLL_CR</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10B0F</resetValue>
                    <resetMask>0x3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>REFSEL</name>
                            <description>desc REFSEL</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FOSC</name>
                            <description>desc FOSC</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIVN</name>
                            <description>desc DIVN</description>
                            <msb>8</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IBSEL</name>
                            <description>desc IBSEL</description>
                            <msb>10</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LFSEL</name>
                            <description>desc LFSEL</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRSEL</name>
                            <description>desc FRSEL</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STARTUP</name>
                            <description>desc STARTUP</description>
                            <msb>17</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OVCK_CR</name>
                    <description>desc OVCK_CR</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>OVCK</name>
                            <description>desc OVCK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RC48M_CR</name>
                    <description>desc RC48M_CR</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x280</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TRIM</name>
                            <description>desc TRIM</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
